package com.huinong.truffle.payment.order.mono.constant;

/**
 * 订单返回错误信息
 * @author peng
 *
 */
public enum OrderResultCode {
	
	//系统异常 14301 - 14350
    SYS_0001(14301,"订单服务状态异常"),
    CODE_HYSTRIX_ERROR(14302, "熔断处理"),
    
    //DB 异常 14351 - 14450
    DB_0001(14351,"订单已支付,请勿重复支付"),
	DB_0002(14352,"创建订单失败"),
	DB_0003(14353,"删除订单信息失败"),
	DB_0004(14354,"查询结果为空"),
	DB_0005(14355,"更新订单状态异常"),
	DB_0006(14356,"订单结算请求超时"),
	DB_0007(14357,"付款单信息与支付订单信息不一致"),
	DB_0008(14358,"结算订单还在审核中"),
	DB_0009(14359,"订单付款成功，请勿重复付款"),
	DB_0010(14360,"新增付款单异常"),
	DB_0011(14361,"更新付款订单状态失败"),
	DB_0012(14362,"子订单金额之和不等于主订单总金额"),
	DB_0013(14363,"订单待支付状态超时"),
	DB_0014(14364,"对象转换异常"),
	DB_0015(14365,"已完成订单状态异常"),
	DB_0016(14366,"查找的订单结果为空"),
	DB_0017(14367,"更新订单信息状态异常"),
	DB_0018(14368,"订单数据不存在"),
	DB_0019(14369,"订单暂未结算,无法发起确认收货"),
	DB_0020(14370,"订单暂未结算,无法发起确认退款"),
	DB_0021(14371,"订单归属不匹配,无法发起确认收货"),
	DB_0022(14372,"订单归属不匹配,无法发起确认退款"),
    
    //入参参数异常 14451 - 14600
	PARAM_0001(14451,"订单项参数为空"),
	PARAM_0002(14452,"输入的参数为空"),
	PARAM_0003(14453,"无法识别{订单号}"),
	PARAM_0004(14454,"无法识别{买家ID}"),
	PARAM_0005(14455,"无法识别{结算总额}"),
	PARAM_0006(14456,"无法识别{子订单编号}"),
	PARAM_0007(14457,"无法识别{卖家ID}"),
	PARAM_0008(14458,"无法识别{收款人账号}"),
	PARAM_0009(14459,"无法识别{收款人名称}"),
	PARAM_0010(14460,"无法识别{招商卡标志}"),
	PARAM_0011(14461,"无法识别{收款银行开户行地址}"),
	PARAM_0012(14462,"无法识别{收款银行开户银行}"),
	PARAM_0013(14463,"无法识别{手续费}"),
	PARAM_0014(14464,"无法识别{支付渠道}"),
	PARAM_0015(14465,"付款方向不在指定范围值内(0-付款 1-退款)"),
	PARAM_0016(14466,"无法识别{订单ID}"),
	PARAM_0017(14467,"无法识别{平台来源}"),
	PARAM_0018(14468,"无法识别{买家惠农网用户ID}"),
	PARAM_0019(14469,"无法识别{下单渠道}"),
	PARAM_0020(14470,"无法识别{流水号}"),
	PARAM_0021(14471,"无法识别{订单状态}"),
	PARAM_0022(14472,"输入的订单状态非法"),
	PARAM_0023(14473,"输入的订单状态不在指定值范围内(PROCESSING-支付中,SUCCESS-支付成功)"),
	PARAM_0024(14474,"无法识别{主订单号}"),
	PARAM_0025(14475,"输入的订单来源不在指定值范围内(HNW,HNYX)"),
	PARAM_0026(14476,"输入的订单下单渠道不在指定值范围内(H5|IOS|ANDROID|PC)"),
	//买家收款卡信息
	;

	private int code;
	private String msg;
	
	private OrderResultCode(int code){
		this.code = code;
	}
	  
	private OrderResultCode(int code, String msg){
		this.code = code ;
		this.msg = msg ;
	}
	
	public String getMsg(){
	    return this.msg;
	}

	public int getCode(){
	    return this.code;
	}

}
